Autodesk.Revit.DB.Structure.RebarContainerItem.CanApplyPresentationMode(Autodesk.Revit.DB.View)
Checks if a presentation mode can be applied for this rebar in the given view.
dBView:
The view in which presentation mode will be applied.
Returns:
True if presentation mode can be applied for this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.FindMatchingPredefinedPresentationMode(Autodesk.Revit.DB.View)
Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view.
Remarks:
If the presentation mode is not PresentationMode.Select for the view, this function returns the current mode.
dBView:
The view.
Returns:
The presentation mode that matches the current set of selected hidden and unhidden bars.
If there is no better match, this returns RebarPresentationMode.Select.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetPresentationMode(Autodesk.Revit.DB.View)
Gets the presentaion mode for this rebar set when displayed in the given view.
dBView:
The view.
Returns:
The presentation mode.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetPresentationMode(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Structure.RebarPresentationMode)
Sets the presentation mode for this rebar set when displayed in the given view.
dBView:
The view.
presentationMode:
The presentation mode.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for dBView, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.ClearPresentationMode(Autodesk.Revit.DB.View)
Sets the presentation mode for this rebar set to the default (either for a single view, or for all views).
dBView:
The view where the presentation mode will be cleared. NULL for all views
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.HasPresentationOverrides(Autodesk.Revit.DB.View)
Identifies if this rebar set has overridden default presentation settings for the given view.
Remarks:
Default presentation settings can be overriden using Autodesk.Revit.DB.Structure.RebarContainerItem.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean), Autodesk.Revit.DB.Structure.RebarContainerItem.SetPresentationMode(Autodesk.Revit.DB.View,Autodesk.Revit.DB.Structure.RebarPresentationMode) methods
dBView:
The view.
Returns:
True if this rebar set has overriden default presentation settings, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.IsRebarInSection(Autodesk.Revit.DB.View)
Identifies if this rebar set is shown as a cross-section in the given view.
dBView:
The view.
Returns:
True if this rebar set is shown as a cross-section, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.IsBarHidden(Autodesk.Revit.DB.View,System.Int32)
Identifies if a given bar in this rebar set is hidden in this view.
view:
The view.
barIndex:
The index of the bar from this rebar set.
Returns:
True if the bar is hidden in this view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetBarHiddenStatus(Autodesk.Revit.DB.View,System.Int32,System.Boolean)
Sets the bar in this rebar set to be hidden or unhidden in the given view.
Remarks:
Individual bars of a rebar set can be hidden in a view only
if the presentation mode is RebarPresentationMode.Select.
If that is not the presentation mode assigned for this set in the view,
this method will also change it.
view:
The view.
barIndex:
The index of the bar from this set.
hide:
True to hide this bar in the view, false to unhide the bar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This rebar cannot have a presentation mode applied for view, as the view is not valid for rebar presentation,
or the orientation of the view matches the normal direction of the rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.CanUseHookType(Autodesk.Revit.DB.ElementId)
Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType
Remarks:
Also, checks that the Style of the Hook matches that of the Rebar's RebarShape
proposedHookId:
The Id of the RebarHookType
Returns:
Returns true if the id is of a valid RebarHookType for the Rebar element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetHookOrientation(System.Int32,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Defines the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
Remarks:
If RebarShapeDefinesHooks property of ReinforcementSettings is true (non-European shapes), setHookOrientation method does nothing.
iEnd:
0 for the start hook, 1 for the end hook.
hookOrientation:
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
iEnd must be 0 or 1.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetHookOrientation(System.Int32)
Returns the orientation of the hook plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal.
iEnd:
0 for the start hook, 1 for the end hook.
Returns:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
iEnd must be 0 or 1.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.DoesBarExistAtPosition(System.Int32)
Checks whether a bar exists at the specified position.
Remarks:
Returns true, unless the bar position is the first or last
in the set and it is suppressed by IncludeFirstBar or
IncludeLastBar.
barPosition:
A bar position index between 0 and NumberOfBarPositions-1.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPosition is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetHookTypeId(System.Int32,Autodesk.Revit.DB.ElementId)
Set the id of the RebarHookType to be applied to the rebar.
end:
0 for the start hook, 1 for the end hook.
hookTypeId:
The id of a RebarHookType element, or invalidElementId if
the rebar should have no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
the rebar hook type id hookTypeId is not valid
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetHookTypeId(System.Int32)
Get the id of the RebarHookType to be applied to the rebar.
end:
0 for the start hook, 1 for the end hook.
Returns:
The id of a RebarHookType, or invalidElementId if the rebar has
no hook at the specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
end must be 0 or 1.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetBendData
Gets the RebarBendData, containing bar and hook information, of the instance.
Remarks:
Internally, the bend data is used by many RebarShape methods to generate shape geometry.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetLayoutAsMinimumClearSpacing(System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to MinimumClearSpacing
Remarks:
When changing the layout rule to MinimumClearSpacing, you must also simultaneously set Spacing,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
spacing:
The maximum spacing between rebar in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This RebarContainerItem is an instance of a spiral or multiplanar shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetLayoutAsNumberWithSpacing(System.Int32,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to NumberWithSpacing
Remarks:
When changing the layout rule to NumberWithSpacing, you must also simultaneously set NumberOfBarPositions,
Spacing, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
numberOfBarPositions:
The number of bar positions in rebar set
spacing:
The maximum spacing between rebar in rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
-or-
The spacing isn't bigger than 0.0.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This RebarContainerItem is an instance of a spiral or multiplanar shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetLayoutAsMaximumSpacing(System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to MaximumSpacing
Remarks:
When changing the layout rule to MaximumSpacing, you must also simultaneously set Spacing,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
spacing:
The maximum spacing between rebar in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The spacing isn't bigger than 0.0.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This RebarContainerItem is an instance of a spiral or multiplanar shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetLayoutAsFixedNumber(System.Int32,System.Double,System.Boolean,System.Boolean,System.Boolean)
Sets the Layout Rule property of rebar set to FixedNumber.
Remarks:
When changing the layout rule to FixedNumber, you must also simultaneously set NumberOfBarPositions,
SetLength, BarsOnNormalSide, IncludeFirstBar, and IncludeLastBar properties.
numberOfBarPositions:
The number of bar positions in rebar set
arrayLength:
The distribution length of rebar set
barsOnNormalSide:
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal
includeFirstBar:
Identifies if the first bar in rebar set is shown
includeLastBar:
Identifies if the last bar in rebar set is shown
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
-or-
the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This RebarContainerItem is an instance of a spiral or multiplanar shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetLayoutAsSingle
Sets the Layout Rule property of rebar set to Single.
Remarks:
Only one bar will remain, which is at the position of rebar plane
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.ComputeDrivingCurves
Compute the driving curves.
Remarks:
The driving curves are the ones that appear in rebar sketch
mode. They include lines and arcs that drive the shape, but
exclude fillets and hooks. They always lie in a plane--
if the bar is 3D, these curves are a subset or a projection.
They are also used for shape matching.
Returns:
Returns an empty array if an error is encountered.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetBarPositionTransform(System.Int32)
Return a transform representing the relative position of any
individual bar in the set.
Remarks:
The transform is a translation along the distribution path.
It can be applied to the results of GetCenterlineCurves() to
produce any bar in the rebar set. For barPositionIndex=0,
the identity transform is always returned.
barPositionIndex:
An index between 0 and (NumberOfBarPositions-1).
Returns:
The position of a bar in the set relative to the first position.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barPositionIndex is not in the range [ 0, NumberOfBarPositions-1 ].
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetDistributionPath
The distribution path of a rebar set.
Returns:
A line beginning at (0, 0, 0) and representing the direction and
length of the set.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean,Autodesk.Revit.DB.Structure.MultiplanarOption)
A chain of curves representing the centerline of the rebar.
Remarks:
If the Rebar is a set, meaning GetLayoutRule() does not return Single,
this method returns the first rebar in the set, even if the
first bar is suppressed by IncludeFirstBar being false.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
multiplanarOption:
If the Rebar is a multi-planar shape, this parameter controls whether to generate only
the curves in the primary plane (IncludeOnlyPlanarCurves), or to generate all curves,
(IncludeAllMultiplanarCurves) including the out-of-plane connector segments as well as
multi-planar copies of the primary plane curves.
This argument is ignored for planar shapes.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.GetCenterlineCurves(System.Boolean,System.Boolean,System.Boolean)
A chain of curves representing the centerline of the rebar.
Remarks:
If the Rebar is a set, meaning GetLayoutRule() does not return Single,
this method returns the first rebar in the set, even if the
first bar is suppressed by IncludeFirstBar being false.
adjustForSelfIntersection:
If the curves overlap, as in a planar stirrup, this parameter controls
whether they should be adjusted to avoid intersection (as in fine views),
or kept in a single plane for simplicity (as in coarse views).
suppressHooks:
Identifies if the chain will include hooks curves.
suppressBendRadius:
Identifies if the connected chain will include unfilleted curves.
Returns:
The centerline curves or empty array if the curves cannot be computed because
the parameters values are inconsistent
with the constraints of the RebarShape definition.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromCurvesAndShape(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation)
Set an instance of a RebarContainerItem element according to the parameters list.
The instance will have the default shape parameters from the RebarShape.
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to true,
then both the curves and hooks must match the RebarShape definition.
Otherwise, the hooks can be different than the defaults specified in the RebarShape
rebarShape:
A RebarShape element that defines the shape of the rebar.
A RebarShape element matches curves and hooks.
A RebarShape element provides RebarStyle of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
-or-
The rebarShape has End Treatments
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and RebarShape style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
rebarShape does not match curves.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromRebarShape(Autodesk.Revit.DB.Structure.RebarShape,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Set an instance of a RebarContainerItem element, as an instance of a RebarShape.
The instance will have the default shape parameters from the RebarShape,
and its location is based on the bounding box of the shape in the shape definition.
Hooks are removed from the shape before computing its bounding box.
If appropriate hooks can be found in the document, they will be assigned arbitrarily.
rebarShape:
A RebarShape element that defines the shape of the rebar.
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
origin:
The lower-left corner of the shape's bounding box will be placed at this point in the project.
xVec:
The x-axis in the shape definition will be mapped to this direction in the project.
yVec:
The y-axis in the shape definition will be mapped to this direction in the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The rebarShape has End Treatments
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
xVec has zero length.
-or-
yVec has zero length.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromCurves(Autodesk.Revit.DB.Structure.RebarStyle,Autodesk.Revit.DB.Structure.RebarBarType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.Structure.RebarHookType,Autodesk.Revit.DB.XYZ,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.Structure.RebarHookOrientation,Autodesk.Revit.DB.Structure.RebarHookOrientation,System.Boolean,System.Boolean)
Set an instance of a RebarContainerItem element according to the parameters list.
style:
The usage of the bar, "standard" or "stirrup/tie".
barType:
A RebarBarType element that defines bar diameter, bend radius and material of the rebar.
startHook:
A RebarHookType element that defines the hook for the start of the bar.
If this parameter is null, it means to create a rebar with no hook.
endHook:
A RebarHookType element that defines the hook for the end of the bar.
If this parameter is null, it means to create a rebar with no hook.
norm:
The normal to the plane that the rebar curves lie on.
curves:
An array of curves that define the shape of the rebar curves.
They must belong to the plane defined by the normal and origin.
Bends and hooks should not be included in the array of curves.
startHookOrient:
Defines the orientation of the hook plane at the start of the rebar with respect to the orientation of the first curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
endHookOrient:
Defines the orientation of the hook plane at the end of the rebar with respect to the orientation of the last curve and the plane normal.
Only two values are permitted:
Value = Right: The hook is on your right as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
Value = Left: The hook is on your left as you stand at the end of the bar,
with the bar behind you, taking the bar's normal as "up."
useExistingShapeIfPossible:
Attempts to assign a RebarShape from those existing in the document. If no shape matches, NewRebar returns  or creates a new shape, according to the parameter createNewShape.
When both parameters are "true", the behavior is the same as sketching rebar in the UI. At least one of these parameters must be "true".
If the RebarShapeDefinesHooks flag in ReinforcementSettings has been set to false, and a RebarShape cannot be found with both matching curves and hooks,
then this method will perform a second search, ignoring hook information.
createNewShape:
Creates a shape in the document to match the curves, hooks, and style specified, and assigns it to the new rebar instance.
Shape creation will not succeed unless one or more other shapes already exist in the document, and these shapes
have enough shape parameters to define a shape for these curves.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input curves is empty.
-or-
The input curves contains at least one curve which is not a bound Line or bound Arc
and is not supported for this operation.
-or-
curves do not form a valid CurveLoop.
-or-
The input curves contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
norm has zero length.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Both useExistingShapeIfPossible and createNewShape are false.
-or-
curves contains non-fillet arcs with radii that are less than the
minimum bend radius for the RebarBarType and bar style.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.SetFromRebar(Autodesk.Revit.DB.Structure.Rebar)
Set an instance of a RebarContainerItem element according to a Rebar parameters.
Will throw exception if given rebar is not shape driven.
rebar:
The Rebar.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The RebarShape of rebar has End Treatments
-or-
Can't create container from free-form rebar.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarContainerItem.ItemIndex
The index of this item in its associated RebarContainer.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.NumberOfBarPositions
The number of potential bars in the set.
Remarks:
The number of positions is equal to the number of actual
bars (the Quantity), plus one or two more positions depending
on IncludeFistBar and IncludeLastBar.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the number of bar positions numberOfBarPositions is less than 1 or more than 1002.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
When setting this property: This rebar element represents a single bar (the layout rule is Single).
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.RebarShapeId
The RebarShape element that defines the shape of the rebar.
Remarks:
Changing the value of this property causes the Rebar instance to choose values for its
shape parameters to preserve its previous shape as closely as possible
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: shapeId is not the id of a RebarShape in the document.
-or-
When setting this property: The RebarShape has End Treatments
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.Volume
The volume of an individual bar multiplied by Quantity.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.TotalLength
The length of an individual bar multiplied by Quantity.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.MultiplanarDepth
For a multiplanar rebar, the depth of the instance.
Remarks:
Applicable only when an instance of a RebarShape with
a RebarShapeMultiplanarDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: multiplanarDepth must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarContainerItem is not an instance of a multiplanar shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.Pitch
For a spiral, the pitch, or vertical distance traveled in one rotation.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: pitch must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarContainerItem is not an instance of a spiral shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.TopFinishingTurns
For a spiral, the number of finishing turns at the upper end of the spiral.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: turns must be between 0 and 100.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarContainerItem is not an instance of a spiral shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.BaseFinishingTurns
For a spiral, the number of finishing turns at the lower end of the spiral.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: turns must be between 0 and 100.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarContainerItem is not an instance of a spiral shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.Height
For a spiral, the overall height.
Remarks:
Applies only to instances where RebarShape.Definition is of type
RebarShapeDefinitionByArc, and its Type property is equal to the value
RebarShapeDefinitionByArcType.Spiral.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: height must be positive.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This RebarContainerItem is not an instance of a spiral shape.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.IncludeLastBar
Identifies if the last bar in rebar set is shown.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.IncludeFirstBar
Identifies if the first bar in rebar set is shown.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.LayoutRule
Identifies the layout rule of rebar set.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.MaxSpacing
Identifies the maximum spacing between rebar in rebar set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The maxSpacing isn't bigger than 0.0.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.Quantity
Identifies the number of bars in rebar set.
Remarks:
Quantity is equal to NumberOfBarPositions if IncludeFirstBar and IncludeLastBar are set.
If any end bars are excluded, they are not counted in the Quantity.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.ArrayLength
Identifies the distribution path length of rebar set.
The distribution path length of rebar set.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the set length arrayLength isn't acceptable.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.BarsOnNormalSide
Identifies if the bars of the rebar set are on the same side of the rebar plane indicated by the normal.
True if the bars of rebar set are on the same side of the rebar plane indicated by the normal,
and false if the bars are on the opposite side.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Throws Autodesk.Revit.Exceptions.InapplicableDataException:
This rebar element represents a single bar (the layout rule is Single).
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.Normal
A unit-length vector normal to the plane of the rebar
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem.BarTypeId
The identifier of the rebar bar type.
Since:
2016

Autodesk.Revit.DB.Structure.RebarContainerItem
Provides implementation for Rebar stored in RebarContainer.
Since:
2016